data = {'name': '缑乐蓉', 'cer_no': '330483198412153552', 'telephone': '15337624981', 'bankid': '6215591678168777528'}  # hqas

data = {'name': '荆访云', 'cer_no': '210726199301152537', 'telephone': '13227465901', 'bankid': '6217221678180013559'}  # hqas
data = {'name': '咸觅柔', 'cer_no': '620423200109172729', 'telephone': '15185749012', 'bankid': '6214751678180030467'}  # hqas
data = {'name': '龚初南', 'cer_no': '420112200010309569', 'telephone': '15845186093', 'bankid': '6215591678180222107'}  # hqas
data = {'name': '麴沛文', 'cer_no': '320802200408068680', 'telephone': '17838714629', 'bankid': '6217211678181442353'}  # hqas
data = {'name': '冀平蝶', 'cer_no': '420702200501181694', 'telephone': '13269532017', 'bankid': '6212881678180245997'}  # hqas
data = {'name': '史语蝶', 'cer_no': '222401199405032847', 'telephone': '18813024857', 'bankid': '6216701678167832733'}  # hqas
data = {'name': '史语蝶', 'cer_no': '222401199405032847', 'telephone': '18813024857', 'bankid': '6216701678167832733'}  # hqas



data = {'name': '白问筠', 'cer_no': '142232199602283331', 'telephone': '18010759326', 'bankid': '6214761678254371407'}  # hqas
data = {'name': '訾紫安', 'cer_no': '32021119851110521X', 'telephone': '18458216394', 'bankid': '6217211678264940844'}  # uat
data = {'name': '任梦菡', 'cer_no': '532125200202064112', 'telephone': '15729187653', 'bankid': '6214761678265066640'}  # uat
data = {'name': '惠冰彤', 'cer_no': '632224197607032280', 'telephone': '17732490751', 'bankid': '6217221678265183160'}  # uat
data = {'name': '司寇从梦', 'cer_no': '520325197602276192', 'telephone': '15528594637', 'bankid': '6214761678265717671'}  # uat
data = {'name': '佟痴珊', 'cer_no': '350301200312314869', 'telephone': '15681276539', 'bankid': '6215591678266502257'}  # uat
data = {'name': '爱友绿', 'cer_no': '140222198112086715', 'telephone': '15951234980', 'bankid': '6212881678266996695'}  # uat
data = {'name': '管傲蕾', 'cer_no': '610526198211058466', 'telephone': '13037526810', 'bankid': '6212881678325206102'}  # uat
data = {'name': '权如之', 'cer_no': '610100199110271443', 'telephone': '13479348061', 'bankid': '6200861678344786869'}  # hqas