
data = {'name': '巩建朋', 'cer_no': '451323201907036981', 'bankid': '6212815192256065264', 'telephone': '13246239750'}  # huat
data = {'name': '幸婵', 'cer_no': '450303201605163049', 'bankid': '6216667768217205683', 'telephone': '17286753402'}  # hpre
data = {'name': '支艺莎', 'cer_no': '371621200909067721', 'bankid': '6212267775119966836', 'telephone': '17715692083'}  # hpre
data = {'name': '席祥', 'cer_no': '331082198705124221', 'bankid': '6217227776075177051', 'telephone': '15791257386'}  # hpre
data = {'name': '许珊娟', 'cer_no': '320682199105218421', 'bankid': '6217867777287221203', 'telephone': '13758420937'}  # hpre
data = {'name': '百瑶', 'cer_no': '370126198304079870', 'bankid': '6217227785310399628', 'telephone': '19145768391'}  # hpre