
data = {'name': '单雅', 'cer_no': '420881198610287296', 'bankid': '6217865143039395724', 'telephone': '17415968702'}  # huat
data = {'name': '艾朗豪', 'cer_no': '130425200110147877', 'bankid': '6228485144134778514', 'telephone': '13434705169'}  # huat
data = {'name': '公鸣', 'cer_no': '530622198706099606', 'bankid': '6217225159153410912', 'telephone': '14960125348'}  # huat
data = {'name': '丰民广', 'cer_no': '370403200609144401', 'bankid': '6216665159962375388', 'telephone': '14706247185'}  # huat -> BaiDu